																/* AB V1.0.0.59.0*/
																/* QQ 1787174068  */
																/* QQ 2278616922*/
// ScriptStruct  AkAudio.AKWaapiJsonObject
// Struct Size::0x0010
struct FAKWaapiJsonObject
{
    char                                          pa_0000[0x0010]                                               // 0x0000(0x0010)
};


// ScriptStruct  CoreUObject.Default
// Struct Size::0x0000
struct FDefault
{
};


// ScriptStruct  AkAudio.AkWaapiSubscriptionId
// Struct Size::0x0008
struct FAkWaapiSubscriptionId
{
    char                                          pa_0000[0x0008]                                               // 0x0000(0x0008)
};


// ScriptStruct  CoreUObject.JoinabilitySettings
// Struct Size::0x0014
struct FJoinabilitySettings
{
    FName                                         SessionName;                                                  // 0x0000(0x0008)
    bool                                          bPublicSearchable;                                            // 0x0008(0x0001)
    bool                                          bAllowInvites;                                                // 0x0009(0x0001)
    bool                                          bJoinViaPresence;                                             // 0x000A(0x0001)
    bool                                          bJoinViaPresenceFriendsOnly;                                  // 0x000B(0x0001)
    int32_t                                       MaxPlayers;                                                   // 0x000C(0x0004)
    int32_t                                       MaxPartySize;                                                 // 0x0010(0x0004)
};


// ScriptStruct  CoreUObject.UniqueNetIdWrapper
// Struct Size::0x0001
struct FUniqueNetIdWrapper
{
    char                                          pa_0000[0x0001]                                               // 0x0000(0x0001)
};


// ScriptStruct  CoreUObject.Guid
// Struct Size::0x0010
struct FGuid
{
    int32_t                                       A;                                                            // 0x0000(0x0004)
    int32_t                                       B;                                                            // 0x0004(0x0004)
    int32_t                                       C;                                                            // 0x0008(0x0004)
    int32_t                                       D;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.Vector
// Struct Size::0x000C
struct FVector
{
    float                                         X;                                                            // 0x0000(0x0004)
    float                                         Y;                                                            // 0x0004(0x0004)
    float                                         Z;                                                            // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.Vector4
// Struct Size::0x0010
struct FVector4
{
    float                                         X;                                                            // 0x0000(0x0004)
    float                                         Y;                                                            // 0x0004(0x0004)
    float                                         Z;                                                            // 0x0008(0x0004)
    float                                         W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.Vector2D
// Struct Size::0x0008
struct FVector2D
{
    float                                         X;                                                            // 0x0000(0x0004)
    float                                         Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.TwoVectors
// Struct Size::0x0018
struct FTwoVectors
{
    FVector                                       v1;                                                           // 0x0000(0x000C)
    FVector                                       v2;                                                           // 0x000C(0x000C)
};


// ScriptStruct  CoreUObject.Plane
// Struct Size::0x0010
struct FPlane : public FVector
{
    float                                         W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.Rotator
// Struct Size::0x000C
struct FRotator
{
    float                                         Pitch;                                                        // 0x0000(0x0004)
    float                                         Yaw;                                                          // 0x0004(0x0004)
    float                                         Roll;                                                         // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.Quat
// Struct Size::0x0010
struct FQuat
{
    float                                         X;                                                            // 0x0000(0x0004)
    float                                         Y;                                                            // 0x0004(0x0004)
    float                                         Z;                                                            // 0x0008(0x0004)
    float                                         W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.PackedNormal
// Struct Size::0x0004
struct FPackedNormal
{
    char                                          X;                                                            // 0x0000(0x0001)
    char                                          Y;                                                            // 0x0001(0x0001)
    char                                          Z;                                                            // 0x0002(0x0001)
    char                                          W;                                                            // 0x0003(0x0001)
};


// ScriptStruct  CoreUObject.PackedRGB10A2N
// Struct Size::0x0004
struct FPackedRGB10A2N
{
    int32_t                                       Packed;                                                       // 0x0000(0x0004)
};


// ScriptStruct  CoreUObject.PackedRGBA16N
// Struct Size::0x0008
struct FPackedRGBA16N
{
    int32_t                                       XY;                                                           // 0x0000(0x0004)
    int32_t                                       ZW;                                                           // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.IntPoint
// Struct Size::0x0008
struct FIntPoint
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.IntVector
// Struct Size::0x000C
struct FIntVector
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
    int32_t                                       Z;                                                            // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.Color
// Struct Size::0x0004
struct FColor
{
    char                                          B;                                                            // 0x0000(0x0001)
    char                                          G;                                                            // 0x0001(0x0001)
    char                                          R;                                                            // 0x0002(0x0001)
    char                                          A;                                                            // 0x0003(0x0001)
};


// ScriptStruct  CoreUObject.LinearColor
// Struct Size::0x0010
struct FLinearColor
{
    float                                         R;                                                            // 0x0000(0x0004)
    float                                         G;                                                            // 0x0004(0x0004)
    float                                         B;                                                            // 0x0008(0x0004)
    float                                         A;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.Box
// Struct Size::0x001C
struct FBox
{
    FVector                                       Min;                                                          // 0x0000(0x000C)
    FVector                                       Max;                                                          // 0x000C(0x000C)
    char                                          IsValid;                                                      // 0x0018(0x0001)
    char                                          pa_0019[0x0003]                                               // 0x0019(0x0003)
};


// ScriptStruct  CoreUObject.Box2D
// Struct Size::0x0014
struct FBox2D
{
    FVector2D                                     Min;                                                          // 0x0000(0x0008)
    FVector2D                                     Max;                                                          // 0x0008(0x0008)
    char                                          bIsValid;                                                     // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
};


// ScriptStruct  CoreUObject.BoxSphereBounds
// Struct Size::0x001C
struct FBoxSphereBounds
{
    FVector                                       Origin;                                                       // 0x0000(0x000C)
    FVector                                       BoxExtent;                                                    // 0x000C(0x000C)
    float                                         SphereRadius;                                                 // 0x0018(0x0004)
};


// ScriptStruct  CoreUObject.OrientedBox
// Struct Size::0x003C
struct FOrientedBox
{
    FVector                                       Center;                                                       // 0x0000(0x000C)
    FVector                                       AxisX;                                                        // 0x000C(0x000C)
    FVector                                       AxisY;                                                        // 0x0018(0x000C)
    FVector                                       AxisZ;                                                        // 0x0024(0x000C)
    float                                         ExtentX;                                                      // 0x0030(0x0004)
    float                                         ExtentY;                                                      // 0x0034(0x0004)
    float                                         ExtentZ;                                                      // 0x0038(0x0004)
};


// ScriptStruct  CoreUObject.Matrix
// Struct Size::0x0040
struct FMatrix
{
    FPlane                                        XPlane;                                                       // 0x0000(0x0010)
    FPlane                                        YPlane;                                                       // 0x0010(0x0010)
    FPlane                                        ZPlane;                                                       // 0x0020(0x0010)
    FPlane                                        WPlane;                                                       // 0x0030(0x0010)
};


// ScriptStruct  CoreUObject.InterpCurvePointFloat
// Struct Size::0x0014
struct FInterpCurvePointFloat
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    float                                         OutVal;                                                       // 0x0004(0x0004)
    float                                         ArriveTangent;                                                // 0x0008(0x0004)
    float                                         LeaveTangent;                                                 // 0x000C(0x0004)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
};


// ScriptStruct  CoreUObject.InterpCurveFloat
// Struct Size::0x0018
struct FInterpCurveFloat
{
    TArray<FInterpCurvePointFloat>                Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointVector2D
// Struct Size::0x0020
struct FInterpCurvePointVector2D
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    FVector2D                                     OutVal;                                                       // 0x0004(0x0008)
    FVector2D                                     ArriveTangent;                                                // 0x000C(0x0008)
    FVector2D                                     LeaveTangent;                                                 // 0x0014(0x0008)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x001C(0x0001)
    char                                          pa_001D[0x0003]                                               // 0x001D(0x0003)
};


// ScriptStruct  CoreUObject.InterpCurveVector2D
// Struct Size::0x0018
struct FInterpCurveVector2D
{
    TArray<FInterpCurvePointVector2D>             Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointVector
// Struct Size::0x002C
struct FInterpCurvePointVector
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    FVector                                       OutVal;                                                       // 0x0004(0x000C)
    FVector                                       ArriveTangent;                                                // 0x0010(0x000C)
    FVector                                       LeaveTangent;                                                 // 0x001C(0x000C)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0028(0x0001)
    char                                          pa_0029[0x0003]                                               // 0x0029(0x0003)
};


// ScriptStruct  CoreUObject.InterpCurveVector
// Struct Size::0x0018
struct FInterpCurveVector
{
    TArray<FInterpCurvePointVector>               Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointQuat
// Struct Size::0x0050
struct FInterpCurvePointQuat
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    char                                          pa_0004[0x000C]                                               // 0x0004(0x000C)
    FQuat                                         OutVal;                                                       // 0x0010(0x0010)
    FQuat                                         ArriveTangent;                                                // 0x0020(0x0010)
    FQuat                                         LeaveTangent;                                                 // 0x0030(0x0010)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0040(0x0001)
    char                                          pa_0041[0x000F]                                               // 0x0041(0x000F)
};


// ScriptStruct  CoreUObject.InterpCurveQuat
// Struct Size::0x0018
struct FInterpCurveQuat
{
    TArray<FInterpCurvePointQuat>                 Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointTwoVectors
// Struct Size::0x0050
struct FInterpCurvePointTwoVectors
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    FTwoVectors                                   OutVal;                                                       // 0x0004(0x0018)
    FTwoVectors                                   ArriveTangent;                                                // 0x001C(0x0018)
    FTwoVectors                                   LeaveTangent;                                                 // 0x0034(0x0018)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x004C(0x0001)
    char                                          pa_004D[0x0003]                                               // 0x004D(0x0003)
};


// ScriptStruct  CoreUObject.InterpCurveTwoVectors
// Struct Size::0x0018
struct FInterpCurveTwoVectors
{
    TArray<FInterpCurvePointTwoVectors>           Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointLinearColor
// Struct Size::0x0038
struct FInterpCurvePointLinearColor
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    FLinearColor                                  OutVal;                                                       // 0x0004(0x0010)
    FLinearColor                                  ArriveTangent;                                                // 0x0014(0x0010)
    FLinearColor                                  LeaveTangent;                                                 // 0x0024(0x0010)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0034(0x0001)
    char                                          pa_0035[0x0003]                                               // 0x0035(0x0003)
};


// ScriptStruct  CoreUObject.InterpCurveLinearColor
// Struct Size::0x0018
struct FInterpCurveLinearColor
{
    TArray<FInterpCurvePointLinearColor>          Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.Transform
// Struct Size::0x0030
struct FTransform
{
    FQuat                                         Rotation;                                                     // 0x0000(0x0010)
    FVector                                       Translation;                                                  // 0x0010(0x000C)
    char                                          pa_001C[0x0004]                                               // 0x001C(0x0004)
    FVector                                       Scale3D;                                                      // 0x0020(0x000C)
    char                                          pa_002C[0x0004]                                               // 0x002C(0x0004)
};


// ScriptStruct  CoreUObject.RandomStream
// Struct Size::0x0008
struct FRandomStream
{
    int32_t                                       InitialSeed;                                                  // 0x0000(0x0004)
    int32_t                                       Seed;                                                         // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.DateTime
// Struct Size::0x0008
struct FDateTime
{
    char                                          pa_0000[0x0008]                                               // 0x0000(0x0008)
};


// ScriptStruct  CoreUObject.FrameNumber
// Struct Size::0x0004
struct FFrameNumber
{
    int32_t                                       Value;                                                        // 0x0000(0x0004)
};


// ScriptStruct  CoreUObject.FrameRate
// Struct Size::0x0008
struct FFrameRate
{
    int32_t                                       Numerator;                                                    // 0x0000(0x0004)
    int32_t                                       Denominator;                                                  // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.FrameTime
// Struct Size::0x0008
struct FFrameTime
{
    FFrameNumber                                  FrameNumber;                                                  // 0x0000(0x0004)
    float                                         SubFrame;                                                     // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.QualifiedFrameTime
// Struct Size::0x0010
struct FQualifiedFrameTime
{
    FFrameTime                                    Time;                                                         // 0x0000(0x0008)
    FFrameRate                                    Rate;                                                         // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Timecode
// Struct Size::0x0014
struct FTimecode
{
    int32_t                                       Hours;                                                        // 0x0000(0x0004)
    int32_t                                       Minutes;                                                      // 0x0004(0x0004)
    int32_t                                       Seconds;                                                      // 0x0008(0x0004)
    int32_t                                       Frames;                                                       // 0x000C(0x0004)
    bool                                          bDropFrameFormat;                                             // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
};


// ScriptStruct  CoreUObject.Timespan
// Struct Size::0x0008
struct FTimespan
{
    char                                          pa_0000[0x0008]                                               // 0x0000(0x0008)
};


// ScriptStruct  CoreUObject.SoftObjectPath
// Struct Size::0x0018
struct FSoftObjectPath
{
    FName                                         AssetPathName;                                                // 0x0000(0x0008)
    FString                                       SubPathString;                                                // 0x0008(0x0010)
};


// ScriptStruct  CoreUObject.SoftClassPath
// Struct Size::0x0018
struct FSoftClassPath : public FSoftObjectPath
{
};


// ScriptStruct  CoreUObject.PrimaryAssetType
// Struct Size::0x0008
struct FPrimaryAssetType
{
    FName                                         Name;                                                         // 0x0000(0x0008)
};


// ScriptStruct  CoreUObject.PrimaryAssetId
// Struct Size::0x0010
struct FPrimaryAssetId
{
    FPrimaryAssetType                             PrimaryAssetType;                                             // 0x0000(0x0008)
    FName                                         PrimaryAssetName;                                             // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.FallbackStruct
// Struct Size::0x0001
struct FFallbackStruct
{
    char                                          pa_0000[0x0001]                                               // 0x0000(0x0001)
};


// ScriptStruct  CoreUObject.FloatRangeBound
// Struct Size::0x0008
struct FFloatRangeBound
{
    enum class ERangeBoundTypes                   Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0003]                                               // 0x0001(0x0003)
    float                                         Value;                                                        // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.FloatRange
// Struct Size::0x0010
struct FFloatRange
{
    FFloatRangeBound                              LowerBound;                                                   // 0x0000(0x0008)
    FFloatRangeBound                              UpperBound;                                                   // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Int32RangeBound
// Struct Size::0x0008
struct FInt32RangeBound
{
    enum class ERangeBoundTypes                   Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0003]                                               // 0x0001(0x0003)
    int32_t                                       Value;                                                        // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Int32Range
// Struct Size::0x0010
struct FInt32Range
{
    FInt32RangeBound                              LowerBound;                                                   // 0x0000(0x0008)
    FInt32RangeBound                              UpperBound;                                                   // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.FrameNumberRangeBound
// Struct Size::0x0008
struct FFrameNumberRangeBound
{
    enum class ERangeBoundTypes                   Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0003]                                               // 0x0001(0x0003)
    FFrameNumber                                  Value;                                                        // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.FrameNumberRange
// Struct Size::0x0010
struct FFrameNumberRange
{
    FFrameNumberRangeBound                        LowerBound;                                                   // 0x0000(0x0008)
    FFrameNumberRangeBound                        UpperBound;                                                   // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.FloatInterval
// Struct Size::0x0008
struct FFloatInterval
{
    float                                         Min;                                                          // 0x0000(0x0004)
    float                                         Max;                                                          // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Int32Interval
// Struct Size::0x0008
struct FInt32Interval
{
    int32_t                                       Min;                                                          // 0x0000(0x0004)
    int32_t                                       Max;                                                          // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.PolyglotTextData
// Struct Size::0x00B8
struct FPolyglotTextData
{
    enum class ELocalizedTextSourceCategory       Category;                                                     // 0x0000(0x0001)
    char                                          pa_0001[0x0007]                                               // 0x0001(0x0007)
    FString                                       NativeCulture;                                                // 0x0008(0x0010)
    FString                                       Namespace;                                                    // 0x0018(0x0010)
    FString                                       Key;                                                          // 0x0028(0x0010)
    FString                                       NativeString;                                                 // 0x0038(0x0010)
    TMap<FString,FString>                         LocalizedStrings;                                             // 0x0048(0x0050)
    bool                                          bIsMinimalPatch;                                              // 0x0098(0x0001)
    char                                          pa_0099[0x0007]                                               // 0x0099(0x0007)
    FText                                         CachedText;                                                   // 0x00A0(0x0018)
};


// ScriptStruct  CoreUObject.AutomationEvent
// Struct Size::0x0038
struct FAutomationEvent
{
    enum class EAutomationEventType               Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0007]                                               // 0x0001(0x0007)
    FString                                       Message;                                                      // 0x0008(0x0010)
    FString                                       Context;                                                      // 0x0018(0x0010)
    FGuid                                         Artifact;                                                     // 0x0028(0x0010)
};


// ScriptStruct  CoreUObject.AutomationExecutionEntry
// Struct Size::0x0058
struct FAutomationExecutionEntry
{
    FAutomationEvent                              Event;                                                        // 0x0000(0x0038)
    FString                                       Filename;                                                     // 0x0038(0x0010)
    int32_t                                       LineNumber;                                                   // 0x0048(0x0004)
    char                                          pa_004C[0x0004]                                               // 0x004C(0x0004)
    FDateTime                                     Timestamp;                                                    // 0x0050(0x0008)
};


// ScriptStruct  CoreUObject.ARFilter
// Struct Size::0x00F0
struct FARFilter
{
    TArray<FName>                                 PackageNames;                                                 // 0x0000(0x0010)
    TArray<FName>                                 PackagePaths;                                                 // 0x0010(0x0010)
    TArray<FName>                                 ObjectPaths;                                                  // 0x0020(0x0010)
    TArray<FName>                                 ClassNames;                                                   // 0x0030(0x0010)
    char                                          pa_0040[0x0050]                                               // 0x0040(0x0050)
    TSet<FName>                                   RecursiveClassesExclusionSet;                                 // 0x0090(0x0050)
    bool                                          bRecursivePaths;                                              // 0x00E0(0x0001)
    bool                                          bRecursiveClasses;                                            // 0x00E1(0x0001)
    bool                                          bIncludeOnlyOnDiskAssets;                                     // 0x00E2(0x0001)
    char                                          pa_00E3[0x000D]                                               // 0x00E3(0x000D)
};


// ScriptStruct  CoreUObject.AssetBundleEntry
// Struct Size::0x0028
struct FAssetBundleEntry
{
    FPrimaryAssetId                               BundleScope;                                                  // 0x0000(0x0010)
    FName                                         BundleName;                                                   // 0x0010(0x0008)
    TArray<FSoftObjectPath>                       BundleAssets;                                                 // 0x0018(0x0010)
};


// ScriptStruct  CoreUObject.AssetBundleData
// Struct Size::0x0010
struct FAssetBundleData
{
    TArray<FAssetBundleEntry>                     Bundles;                                                      // 0x0000(0x0010)
};


// ScriptStruct  CoreUObject.AssetData
// Struct Size::0x0050
struct FAssetData
{
    FName                                         ObjectPath;                                                   // 0x0000(0x0008)
    FName                                         PackageName;                                                  // 0x0008(0x0008)
    FName                                         PackagePath;                                                  // 0x0010(0x0008)
    FName                                         AssetName;                                                    // 0x0018(0x0008)
    FName                                         AssetClass;                                                   // 0x0020(0x0008)
    char                                          pa_0028[0x0028]                                               // 0x0028(0x0028)
};


// ScriptStruct  GameplayTags.GameplayTag
// Struct Size::0x0008
struct FGameplayTag
{
    FName                                         TagName;                                                      // 0x0000(0x0008)
};


// ScriptStruct  Engine.DistributionLookupTable
// Struct Size::0x0020
struct FDistributionLookupTable
{
    float                                         TimeScale;                                                    // 0x0000(0x0004)
    float                                         TimeBias;                                                     // 0x0004(0x0004)
    TArray<float>                                 Values;                                                       // 0x0008(0x0010)
    char                                          Op;                                                           // 0x0018(0x0001)
    char                                          EntryCount;                                                   // 0x0019(0x0001)
    char                                          EntryStride;                                                  // 0x001A(0x0001)
    char                                          SubEntryStride;                                               // 0x001B(0x0001)
    char                                          LockFlag;                                                     // 0x001C(0x0001)
    char                                          pa_001D[0x0003]                                               // 0x001D(0x0003)
};


// ScriptStruct  Engine.RawDistribution
// Struct Size::0x0020
struct FRawDistribution
{
    FDistributionLookupTable                      Table;                                                        // 0x0000(0x0020)
};


// ScriptStruct  Engine.FloatDistribution
// Struct Size::0x0020
struct FFloatDistribution
{
    FDistributionLookupTable                      Table;                                                        // 0x0000(0x0020)
};


// ScriptStruct  Engine.VectorDistribution
// Struct Size::0x0020
struct FVectorDistribution
{
    FDistributionLookupTable                      Table;                                                        // 0x0000(0x0020)
};


// ScriptStruct  Engine.Vector4Distribution
// Struct Size::0x0020
struct FVector4Distribution
{
    FDistributionLookupTable                      Table;                                                        // 0x0000(0x0020)
};


// ScriptStruct  Engine.FloatRK4SpringInterpolator
// Struct Size::0x0008
struct FFloatRK4SpringInterpolator
{
    float                                         StiffnessConstant;                                            // 0x0000(0x0004)
    float                                         DampeningRatio;                                               // 0x0004(0x0004)
};


// ScriptStruct  Engine.VectorRK4SpringInterpolator
// Struct Size::0x0008
struct FVectorRK4SpringInterpolator
{
    float                                         StiffnessConstant;                                            // 0x0000(0x0004)
    float                                         DampeningRatio;                                               // 0x0004(0x0004)
};


// ScriptStruct  Engine.FormatArgumentData
// Struct Size::0x0040
struct FFormatArgumentData
{
    FString                                       ArgumentName;                                                 // 0x0000(0x0010)
    enum class EFormatArgumentType                ArgumentValueType;                                            // 0x0010(0x0001)
    char                                          pa_0011[0x0007]                                               // 0x0011(0x0007)
    FText                                         ArgumentValue;                                                // 0x0018(0x0018)
    int32_t                                       ArgumentValueInt;                                             // 0x0030(0x0004)
    float                                         ArgumentValueFloat;                                           // 0x0034(0x0004)
    enum class ETextGender                        ArgumentValueGender;                                          // 0x0038(0x0001)
    char                                          pa_0039[0x0007]                                               // 0x0039(0x0007)
};


// ScriptStruct  Engine.ExpressionInput
// Struct Size::0x000C
struct FExpressionInput
{
    int32_t                                       OutputIndex;                                                  // 0x0000(0x0004)
    FName                                         ExpressionName;                                               // 0x0004(0x0008)
};


// ScriptStruct  Engine.MaterialAttributesInput
// Struct Size::0x0018
struct FMaterialAttributesInput : public FExpressionInput
{
    char                                          pa_000C[0x0004]                                               // 0x000C(0x0004)
    uint64_t                                      PropertyConnectedBitmask;                                     // 0x0010(0x0008)
};


// ScriptStruct  Engine.ExpressionOutput
// Struct Size::0x0008
struct FExpressionOutput
{
    FName                                         OutputName;                                                   // 0x0000(0x0008)
};


// ScriptStruct  Engine.MaterialInput
// Struct Size::0x000C
struct FMaterialInput
{
    int32_t                                       OutputIndex;                                                  // 0x0000(0x0004)
    FName                                         ExpressionName;                                               // 0x0004(0x0008)
};


// ScriptStruct  Engine.ColorMaterialInput
// Struct Size::0x000C
struct FColorMaterialInput : public FMaterialInput
{
};


// ScriptStruct  Engine.ScalarMaterialInput
// Struct Size::0x000C
struct FScalarMaterialInput : public FMaterialInput
{
};


// ScriptStruct  Engine.ShadingModelMaterialInput
// Struct Size::0x000C
struct FShadingModelMaterialInput : public FMaterialInput
{
};


// ScriptStruct  Engine.VectorMaterialInput
// Struct Size::0x000C
struct FVectorMaterialInput : public FMaterialInput
{
};


// ScriptStruct  Engine.Vector2MaterialInput
// Struct Size::0x000C
struct FVector2MaterialInput : public FMaterialInput
{
};


// ScriptStruct  Engine.HitResult
// Struct Size::0x0098
struct FHitResult
{
    char                                          bBlockingHit;                                                 // 0x0000(0x0001)
    char                                          bStartPenetrating;                                            // 0x0000(0x0001)
    char                                          pa_0001[0x0003]                                               // 0x0001(0x0003)
    int32_t                                       FaceIndex;                                                    // 0x0004(0x0004)
    float                                         Time;                                                         // 0x0008(0x0004)
    float                                         Distance;                                                     // 0x000C(0x0004)
    FVector                                       Location;                                                     // 0x0010(0x000C)
    FVector                                       ImpactPoint;                                                  // 0x001C(0x000C)
    FVector                                       Normal;                                                       // 0x0028(0x000C)
    FVector                                       ImpactNormal;                                                 // 0x0034(0x000C)
    FVector                                       TraceStart;                                                   // 0x0040(0x000C)
    FVector                                       TraceEnd;                                                     // 0x004C(0x000C)
    float                                         PenetrationDepth;                                             // 0x0058(0x0004)
    int32_t                                       item;                                                         // 0x005C(0x0004)
    char                                          ElementIndex;                                                 // 0x0060(0x0001)
    char                                          pa_0061[0x0003]                                               // 0x0061(0x0003)
    TWeakObjectPtr<UPhysicalMaterial>             PhysMaterial;                                                 // 0x0064(0x0008)
    TWeakObjectPtr<AActor>                        Actor;                                                        // 0x006C(0x0008)
    TWeakObjectPtr<UPrimitiveComponent>           Component;                                                    // 0x0074(0x0008)
    FName                                         BoneName;                                                     // 0x007C(0x0008)
    FName                                         MyBoneName;                                                   // 0x0084(0x0008)
    char                                          pa_008C[0x000C]                                               // 0x008C(0x000C)
};


// ScriptStruct  Engine.Vector
// Struct Size::0x000C
struct FVector : public FVector
{
};


// ScriptStruct  Engine.Vector
// Struct Size::0x000C
struct FVector : public FVector
{
};


// ScriptStruct  InputCore.Key
// Struct Size::0x0018
struct FKey
{
    FName                                         KeyName;                                                      // 0x0000(0x0008)
    char                                          pa_0008[0x0010]                                               // 0x0008(0x0010)
};


// ScriptStruct  Engine.BranchingPointNotifyPayload
// Struct Size::0x0020
struct FBranchingPointNotifyPayload
{
    char                                          pa_0000[0x0020]                                               // 0x0000(0x0020)
};


// ScriptStruct  Engine.SimpleMemberReference
// Struct Size::0x0020
struct FSimpleMemberReference
{
    UObject*                                      MemberParent;                                                 // 0x0000(0x0008)
    FName                                         MemberName;                                                   // 0x0008(0x0008)
    FGuid                                         MemberGuid;                                                   // 0x0010(0x0010)
};


// ScriptStruct  Engine.TickFunction
// Struct Size::0x0038
struct FTickFunction
{
    char                                          pa_0000[0x0008]                                               // 0x0000(0x0008)
    enum class ETickingGroup                      TickGroup;                                                    // 0x0008(0x0001)
    enum class ETickingGroup                      EndTickGroup;                                                 // 0x0009(0x0001)
    char                                          pa_000A[0x000A]                                               // 0x000A(0x000A)
    enum class ESkippableTickMode                 TickMode;                                                     // 0x0014(0x0001)
    char                                          bTickEvenWhenPaused;                                          // 0x0015(0x0001)
    char                                          bCanEverTick;                                                 // 0x0015(0x0001)
    char                                          bEnableTickOpt;                                               // 0x0015(0x0001)
    char                                          bStartWithTickEnabled;                                        // 0x0015(0x0001)
    char                                          bAllowTickOnDedicatedServer;                                  // 0x0015(0x0001)
    char                                          pa_0016[0x0002]                                               // 0x0016(0x0002)
    float                                         TickInterval;                                                 // 0x0018(0x0004)
    char                                          pa_001C[0x001C]                                               // 0x001C(0x001C)
};


// ScriptStruct  Engine.ActorComponentTickFunction
// Struct Size::0x0040
struct FActorComponentTickFunction : public FTickFunction
{
    char                                          pa_0038[0x0008]                                               // 0x0038(0x0008)
};


// ScriptStruct  Engine.SubtitleCue
// Struct Size::0x0020
struct FSubtitleCue
{
    FText                                         Text;                                                         // 0x0000(0x0018)
    float                                         Time;                                                         // 0x0018(0x0004)
    char                                          pa_001C[0x0004]                                               // 0x001C(0x0004)
};


// ScriptStruct  Engine.InterpControlPoint
// Struct Size::0x001C
struct FInterpControlPoint
{
    FVector                                       PositionControlPoint;                                         // 0x0000(0x000C)
    bool                                          bPositionIsRelative;                                          // 0x000C(0x0001)
    char                                          pa_000D[0x000F]                                               // 0x000D(0x000F)
};


// ScriptStruct  Engine.PlatformInterfaceDelegateResult
// Struct Size::0x0038
struct FPlatformInterfaceDelegateResult
{
    bool                                          bSuccessful;                                                  // 0x0000(0x0001)
    char                                          pa_0001[0x0007]                                               // 0x0001(0x0007)
    FPlatformInterfaceData                        Data;                                                         // 0x0008(0x0030)
};


// ScriptStruct  Engine.PlatformInterfaceData
// Struct Size::0x0030
struct FPlatformInterfaceData
{
    FName                                         DataName;                                                     // 0x0000(0x0008)
    enum class EPlatformInterfaceDataType         Type;                                                         // 0x0008(0x0001)
    char                                          pa_0009[0x0003]                                               // 0x0009(0x0003)
    int32_t                                       IntValue;                                                     // 0x000C(0x0004)
    float                                         FloatValue;                                                   // 0x0010(0x0004)
    char                                          pa_0014[0x0004]                                               // 0x0014(0x0004)
    FString                                       StringValue;                                                  // 0x0018(0x0010)
    UObject*                                      ObjectValue;                                                  // 0x0028(0x0008)
};


// ScriptStruct  Engine.DebugFloatHistory
// Struct Size::0x0020
struct FDebugFloatHistory
{
    TArray<float>                                 Samples;                                                      // 0x0000(0x0010)
    float                                         MaxSamples;                                                   // 0x0010(0x0004)
    float                                         MinValue;                                                     // 0x0014(0x0004)
    float                                         MaxValue;                                                     // 0x0018(0x0004)
    bool                                          bAutoAdjustMinMax;                                            // 0x001C(0x0001)
    char                                          pa_001D[0x0003]                                               // 0x001D(0x0003)
};


// ScriptStruct  Engine.LatentActionInfo
// Struct Size::0x0018
struct FLatentActionInfo
{
    int32_t                                       Linkage;                                                      // 0x0000(0x0004)
    int32_t                                       UUID;                                                         // 0x0004(0x0004)
    FName                                         ExecutionFunction;                                            // 0x0008(0x0008)
    UObject*                                      CallbackTarget;                                               // 0x0010(0x0008)
};


// ScriptStruct  Engine.TimerHandle
// Struct Size::0x0008
struct FTimerHandle
{
    uint64_t                                      Handle;                                                       // 0x0000(0x0008)
};


// ScriptStruct  Engine.CollisionProfileName
// Struct Size::0x0008
struct FCollisionProfileName
{
    FName                                         Name;                                                         // 0x0000(0x0008)
};


// ScriptStruct  Engine.GenericStruct
// Struct Size::0x0004
struct FGenericStruct
{
    int32_t                                       Data;                                                         // 0x0000(0x0004)
};


// ScriptStruct  Engine.UserActivity
// Struct Size::0x0018
struct FUserActivity
{
    FString                                       ActionName;                                                   // 0x0000(0x0010)
    char                                          pa_0010[0x0008]                                               // 0x0010(0x0008)
};


// ScriptStruct  Engine.FastArraySerializerItem
// Struct Size::0x000C
struct FFastArraySerializerItem
{
    int32_t                                       ReplicationID;                                                // 0x0000(0x0004)
    int32_t                                       ReplicationKey;                                               // 0x0004(0x0004)
    int32_t                                       MostRecentArrayReplicationKey;                                // 0x0008(0x0004)
};


// ScriptStruct  GameplayAbilities.ActiveGameplayEffect
// Struct Size::0x0368
struct FActiveGameplayEffect : public FFastArraySerializerItem
{
    char                                          pa_000C[0x000C]                                               // 0x000C(0x000C)
    FGameplayEffectSpec                           Spec;                                                         // 0x0018(0x0298)
    FPredictionKey                                PredictionKey;                                                // 0x02B0(0x0010)
    float                                         StartServerWorldTime;                                         // 0x02C0(0x0004)
    float                                         CachedStartServerWorldTime;                                   // 0x02C4(0x0004)
    float                                         StartWorldTime;                                               // 0x02C8(0x0004)
    bool                                          bIsInhibited;                                                 // 0x02CC(0x0001)
    char                                          pa_02CD[0x009B]                                               // 0x02CD(0x009B)
};


// ScriptStruct  GameplayAbilities.PredictionKey
// Struct Size::0x0010
struct FPredictionKey
{
    UPackageMap*                                  PredictiveConnection;                                         // 0x0000(0x0008)
    int16_t                                       Current;                                                      // 0x0008(0x0002)
    int16_t                                       Base;                                                         // 0x000A(0x0002)
    bool                                          bIsStale;                                                     // 0x000C(0x0001)
    bool                                          bIsServerInitiated;                                           // 0x000D(0x0001)
    char                                          pa_000E[0x0002]                                               // 0x000E(0x0002)
};


// ScriptStruct  GameplayAbilities.GameplayEffectSpec
// Struct Size::0x0298
struct FGameplayEffectSpec
{
    UGameplayEffect*                              Def;                                                          // 0x0000(0x0008)
    TArray<FGameplayEffectModifiedAttribute>      ModifiedAttributes;                                           // 0x0008(0x0010)
    FGameplayEffectAttributeCaptureSpecContainer  CapturedRelevantAttributes;                                   // 0x0018(0x0028)
    char                                          pa_0040[0x0010]                                               // 0x0040(0x0010)
    float                                         Duration;                                                     // 0x0050(0x0004)
    float                                         Period;                                                       // 0x0054(0x0004)
    float                                         ChanceToApplyToTarget;                                        // 0x0058(0x0004)
    char                                          pa_005C[0x0004]                                               // 0x005C(0x0004)
    FTagContainerAggregator                       CapturedSourceTags;                                           // 0x0060(0x0088)
    FTagContainerAggregator                       CapturedTargetTags;                                           // 0x00E8(0x0088)
    FGameplayTagContainer                         DynamicGrantedTags;                                           // 0x0170(0x0020)
    FGameplayTagContainer                         DynamicAssetTags;                                             // 0x0190(0x0020)
    TArray<FModifierSpec>                         Modifiers;                                                    // 0x01B0(0x0010)
    int32_t                                       StackCount;                                                   // 0x01C0(0x0004)
    char                                          bCompletedSourceAttributeCapture;                             // 0x01C4(0x0001)
    char                                          bCompletedTargetAttributeCapture;                             // 0x01C4(0x0001)
    char                                          bDurationLocked;                                              // 0x01C4(0x0001)
    char                                          pa_01C5[0x0003]                                               // 0x01C5(0x0003)
    TArray<FGameplayAbilitySpecDef>               GrantedAbilitySpecs;                                          // 0x01C8(0x0010)
    char                                          pa_01D8[0x00A0]                                               // 0x01D8(0x00A0)
    FGameplayEffectContextHandle                  EffectContext;                                                // 0x0278(0x0018)
    float                                         Level;                                                        // 0x0290(0x0004)
    char                                          pa_0294[0x0004]                                               // 0x0294(0x0004)
};


// ScriptStruct  GameplayAbilities.GameplayEffectContextHandle
// Struct Size::0x0018
